//------------------------------------------------------------------------------
//! @file	type.h
//! @brief	タイプ
//! @author	nobuo takahashi
//------------------------------------------------------------------------------
#pragma once


using u8  =		unsigned char;		// 符号なし８ビット整数
using u16 =		unsigned short;		// 符号なし１６ビット整数
using u32 =		unsigned int;		// 符号なし３２ビット整数
using u64 =		unsigned long long;	// 符号なし６４ビット整数
using s8  =		signed char;		// 符号あり８ビット整数
using s16 =		signed short;		// 符号あり１６ビット整数
using s32 =		signed int;			// 符号あり３２ビット整数
using s64 =		signed long long;	// 符号あり６４ビット整数
using f32 =		float;				// ３２ビット浮動小数
using f64 =		double;				// ６４ビット浮動小数

//------------------------------------------------------------------------------
// EOF
//------------------------------------------------------------------------------